lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/ZigbeeHaOnOffLightJoinable/ZigbeeHaOnOffLightJoinable.ino
  if (responseLength > 0U &&
      aps.deliveryMode == kZigbeeApsDeliveryUnicast) {
    (void)sendApsFrame(nwk.sourceShort, aps.sourceEndpoint, aps.clusterId,
                       aps.profileId, aps.destinationEndpoint, responseFrame,
                       responseLength);
  }
}

void pollCoordinator() {
  if (!g_joined) {
    return;
  }

  uint8_t request[127] = {0U};
  uint8_t requestLength = 0U;
  if (!ZigbeeCodec::buildDataRequest(g_macSequence++, g_panId, g_parentShort,
                                     kIeeeAddress, request, &requestLength)) {
    return;
  }
  if (!g_radio.transmit(request, requestLength, false, 1200000UL)) {
    return;
  }

  const uint32_t deadline = millis() + 80U;
  while (static_cast<int32_t>(millis() - deadline) < 0) {
    ZigbeeFrame frame{};
    if (!g_radio.receive(&frame, 4000U, 250000UL)) {
      continue;
    }
    processIncomingFrame(frame);
    return;
  }
}

void maybeSendScheduledReports(uint32_t nowMs) {
  if (!g_joined) {
    return;
  }

  const ZigbeeReportingConfiguration* reporting = g_device.reportingConfigurations();
  for (uint8_t i = 0U; i < 8U; ++i) {
    if (!reporting[i].used || reporting[i].maximumIntervalSeconds == 0U ||
        reporting[i].maximumIntervalSeconds == 0xFFFFU) {
      continue;
    }

    const uint32_t periodMs =
        static_cast<uint32_t>(reporting[i].maximumIntervalSeconds) * 1000UL;
    if ((nowMs - g_lastReportMs[i]) < periodMs) {
      continue;
    }

    if (sendAttributeReport(reporting[i].clusterId)) {
      g_lastReportMs[i] = nowMs;
    }
  }
}

void handleSerialCommands() {
  while (Serial.available() > 0) {
    const int ch = Serial.read();
    if (ch == 't') {
      g_savedOnOffState = !g_device.onOff();
      g_device.setOnOff(g_savedOnOffState);
      applyLedState();
      persistState();
      Serial.print("toggle onoff=");
      Serial.print(g_device.onOff() ? "ON" : "OFF");
      Serial.print("\r\n");
    } else if (ch == 'r') {
      const bool ok = sendAttributeReport(kZigbeeClusterOnOff);
      Serial.print("report ");
      Serial.print(ok ? "OK" : "FAIL");
      Serial.print("\r\n");
    } else if (ch == 'j') {
      clearJoinState(false);
      Serial.print("rejoin requested\r\n");
    } else if (ch == 'c') {
      clearJoinState(true);
      Serial.print("state cleared\r\n");
    } else if (ch == 's') {
      Serial.print("state joined=");
      Serial.print(g_joined ? "yes" : "no");
      Serial.print(" ch=");
      Serial.print(g_channel);
      Serial.print(" pan=0x");
      Serial.print(g_panId, HEX);
      Serial.print(" short=0x");
      Serial.print(g_localShort, HEX);
      Serial.print(" onoff=");
      Serial.print(g_device.onOff() ? "ON" : "OFF");
      Serial.print("\r\n");
    }
  }
}

}  // namespace

void setup() {
  Serial.begin(115200);
  delay(300);

  Gpio::configure(kPinUserLed, GpioDirection::kOutput, GpioPull::kDisabled);
  g_store.begin("zbjoinlt");
  restoreState();

  const bool ok = g_radio.begin(g_channel, 8);
  Serial.print("\r\nZigbeeHaOnOffLightJoinable start\r\n");
  Serial.print("radio=");
  Serial.print(ok ? "OK" : "FAIL");
  Serial.print(" preferred_channel=");
  Serial.print(kPreferredChannel);
  Serial.print(" joined=");
  Serial.print(g_joined ? "yes" : "no");
  Serial.print("\r\n");
  Serial.print("serial commands: t=toggle r=report s=status j=rejoin c=clear\r\n");

  if (g_joined) {
    g_radio.setChannel(g_channel);
    if (g_securityEnabled && g_haveActiveNetworkKey) {
      (void)sendDeviceAnnounce();
    }
  }
}

void loop() {
  handleSerialCommands();

  const uint32_t now = millis();
  if (!g_joined) {
    if ((now - g_lastJoinAttemptMs) >= 2000U) {
      g_lastJoinAttemptMs = now;
      Serial.print("scan_join start\r\n");
      if (performJoin()) {
        Serial.print("join OK ch=");
        Serial.print(g_channel);
        Serial.print(" pan=0x");
        Serial.print(g_panId, HEX);
        Serial.print(" short=0x");
        Serial.print(g_localShort, HEX);
        Serial.print("\r\n");
      } else {
        Serial.print("join MISS\r\n");
      }
    }
    delay(1);
    return;
  }

  if ((now - g_lastPollMs) >= 250U) {
    g_lastPollMs = now;
    pollCoordinator();
  }
  maybeSendScheduledReports(now);

  if ((now - g_lastStatusMs) >= 5000U) {
    g_lastStatusMs = now;
    Serial.print("alive ch=");
    Serial.print(g_channel);
    Serial.print(" pan=0x");
    Serial.print(g_panId, HEX);
    Serial.print(" short=0x");
    Serial.print(g_localShort, HEX);
    Serial.print(" onoff=");
    Serial.print(g_device.onOff() ? "ON" : "OFF");
    Serial.print("\r\n");
  }

  delay(1);
}
